<a href="https://colab.research.google.com/github/manish-kumar-3/192124035-QPDS/blob/main/192124035_Day2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

9.	Write a Pandas program to create a Pivot table and find the total sale amount region wise, manager wise, sales man wise. .(refer sales_data table)

In [2]:
import pandas as pd

# Sample data (replace this with your actual sales_data)
data = {
    'Region': ['North', 'North', 'South', 'South', 'East', 'East', 'West', 'West'],
    'Manager': ['Alice', 'Alice', 'Bob', 'Bob', 'Charlie', 'Charlie', 'David', 'David'],
    'Salesperson': ['John', 'Jane', 'Sam', 'Sara', 'Eve', 'Ella', 'Tom', 'Tina'],
    'SaleAmount': [1000, 1200, 800, 950, 1300, 1100, 750, 900]
}

# Create a DataFrame from the sample data
df = pd.DataFrame(data)

# Create a Pivot table to find total sales amount by Region, Manager, and Salesperson
pivot_table = df.pivot_table(index=['Region', 'Manager', 'Salesperson'], values='SaleAmount', aggfunc='sum')

# Display the Pivot table
print(pivot_table)

                            SaleAmount
Region Manager Salesperson
East   Charlie Ella               1100
               Eve                1300
North  Alice   Jane               1200
               John               1000
South  Bob     Sam                 800
               Sara                950
West   David   Tina                900
               Tom                 750

10.Create a dataframe of ten rows, four columns with random values. Write a Pandas program to highlight the negative numbers red and positive numbers black.

In [3]:
import pandas as pd
import numpy as np

# Create a DataFrame with random values
data = np.random.randn(10, 4)

# Create the DataFrame
df = pd.DataFrame(data, columns=['A', 'B', 'C', 'D'])

# Define a function to style the DataFrame
def highlight_numbers(val):
    color = 'color: black' if val >= 0 else 'color: red'
    return color

# Apply the styling function to the DataFrame
styled_df = df.style.applymap(highlight_numbers)

# Display the styled DataFrame
styled_df

11.Create a dataframe of ten rows, four columns with random values. Convert some values to nan values. Write a Pandas program which will highlight the nan values.

In [4]:
import pandas as pd
import numpy as np

# Create a DataFrame with random values
data = np.random.rand(10, 4)

# Convert some values to NaN
data[np.random.choice([True, False], size=data.shape)] = np.nan

# Create the DataFrame
df = pd.DataFrame(data, columns=['A', 'B', 'C', 'D'])

# Define a function to highlight NaN values
def highlight_nan(val):
    if pd.isna(val):
        return 'background-color: yellow'
    return ''

# Apply the styling function to the DataFrame
styled_df = df.style.applymap(highlight_nan)

# Display the styled DataFrame
styled_df

12.Create a dataframe of ten rows, four columns with random values. Write a Pandas program to set dataframe background Color black and font color yellow.

In [5]:
import pandas as pd
import numpy as np

# Create a DataFrame with random values
data = np.random.rand(10, 4)

# Create the DataFrame
df = pd.DataFrame(data, columns=['A', 'B', 'C', 'D'])

# Define a function to set the background color to black and font color to yellow
def style_df(val):
    return 'background-color: black; color: yellow'

# Apply the styling function to the entire DataFrame
styled_df = df.style.applymap(style_df)

# Display the styled DataFrame
styled_df

13.Write a Pandas program to detect missing values of a given DataFrame. Display True or False

In [7]:
import pandas as pd
import numpy as np

# Create a sample DataFrame with missing values
data = {
    'order_no': [7001, np.nan,7002, np.nan, 7004,7005,7006,7009,7013],
    'pur_amt': [159,220,567,np.nan,np.nan, 2, 3, np.nan, 5],
    'order_dte': [2021-10-5,2021-12-9, 2021-11-23,2021-4-11,np.nan,2021-5-26,np.nan,2021-8-7,np.nan],
    'customer_data':[3001,3002,3004,3001,3002,3001,3003,3005,3007],
    'salesman_id':[5002,5001,5003,5004,5006,np.nan,5002,np.nan,5004]
}

df = pd.DataFrame(data)
print(df)
# Detect missing values and display True or False
missing_values = df.isna()

# Display the result
print(missing_values)

   order_no  pur_amt  order_dte  customer_data  salesman_id
0    7001.0    159.0     2006.0           3001       5002.0
1       NaN    220.0     2000.0           3002       5001.0
2    7002.0    567.0     1987.0           3004       5003.0
3       NaN      NaN     2006.0           3001       5004.0
4    7004.0      NaN        NaN           3002       5006.0
5    7005.0      2.0     1990.0           3001          NaN
6    7006.0      3.0        NaN           3003       5002.0
7    7009.0      NaN     2006.0           3005          NaN
8    7013.0      5.0        NaN           3007       5004.0
   order_no  pur_amt  order_dte  customer_data  salesman_id
0     False    False      False          False        False
1      True    False      False          False        False
2     False    False      False          False        False
3      True     True      False          False        False
4     False     True       True          False        False
5     False    False      False          False         True
6     False    False       True          False        False
7     False     True      False          False         True
8     False    False       True          False        False

14.Write a Pandas program to find and replace the missing values in a given DataFrame which do not have any valuable information.

In [8]:
import pandas as pd
import numpy as np

# Create a sample DataFrame with missing values
data = {
    'order_no': [7001, np.nan,7002, np.nan, 7004, 7005,7006,7009,7013],
    'pur_amt': [159,220,567,np.nan,np.nan, 2, 3, np.nan, 5],
    'order_dte': [2021-10-5,2021-12-9, 2021-11-23,2021-4-11,np.nan,2021-5-26,np.nan,2021-8-7,np.nan],
    'customer_data':[3001,3002,3004,3001,3002,3001,3003,3005,3007],
    'salesman_id':[5002,5001,5003,5004,5006,np.nan,5002,np.nan,5004]
}

df = pd.DataFrame(data)
print(df)
df = df.fillna(0)
print(df)

   order_no  pur_amt  order_dte  customer_data  salesman_id
0    7001.0    159.0     2006.0           3001       5002.0
1       NaN    220.0     2000.0           3002       5001.0
2    7002.0    567.0     1987.0           3004       5003.0
3       NaN      NaN     2006.0           3001       5004.0
4    7004.0      NaN        NaN           3002       5006.0
5    7005.0      2.0     1990.0           3001          NaN
6    7006.0      3.0        NaN           3003       5002.0
7    7009.0      NaN     2006.0           3005          NaN
8    7013.0      5.0        NaN           3007       5004.0
   order_no  pur_amt  order_dte  customer_data  salesman_id
0    7001.0    159.0     2006.0           3001       5002.0
1       0.0    220.0     2000.0           3002       5001.0
2    7002.0    567.0     1987.0           3004       5003.0
3       0.0      0.0     2006.0           3001       5004.0
4    7004.0      0.0        0.0           3002       5006.0
5    7005.0      2.0     1990.0           3001          0.0
6    7006.0      3.0        0.0           3003       5002.0
7    7009.0      0.0     2006.0           3005          0.0
8    7013.0      5.0        0.0           3007       5004.0

15.Write a Pandas program to keep the rows with at least 2 NaN values in a given DataFrame

In [12]:
import pandas as pd
import numpy as np

# Create a sample DataFrame with missing values
data = {
    'order_no': [7001, np.nan,7002, np.nan, 7004, np.nan,7006,7009,7013],
    'pur_amt': [159,220,567,np.nan,np.nan, 2, 3, np.nan, 5],
    'order_dte': [2021-10-5,2021-12-9, 2021-11-23,2021-4-11,np.nan,2021-5-26,np.nan,2021-8-7,np.nan],
    'customer_data':[3001,3002,3004,3001,3002,3001,3003,3005,3007],
    'salesman_id':[5002,5001,np.nan,5004,5006,np.nan,5002,np.nan,5004]
}

df = pd.DataFrame(data)
threshold = 2
df_filtered = df.dropna(thresh=threshold)
print(df_filtered)

   order_no  pur_amt  order_dte  customer_data  salesman_id
0    7001.0    159.0     2006.0           3001       5002.0
1       NaN    220.0     2000.0           3002       5001.0
2    7002.0    567.0     1987.0           3004          NaN
3       NaN      NaN     2006.0           3001       5004.0
4    7004.0      NaN        NaN           3002       5006.0
5       NaN      2.0     1990.0           3001          NaN
6    7006.0      3.0        NaN           3003       5002.0
7    7009.0      NaN     2006.0           3005          NaN
8    7013.0      5.0        NaN           3007       5004.0

16.Write a Pandas program to split the following dataframe into groups based on school code. Also check the type of GroupBy object.

In [14]:
import pandas as pd

# Create a sample DataFrame
data = {
    'Student': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'School Code': ['S001', 'S002', 'S001', 'S003', 'S002'],
    'Age': [25, 24, 22, 23, 26],
    'height':[165,155,145,170,176],
    'weight':[58,56,66,69,65],
    'class':[8,9,8,9,10]
}

df = pd.DataFrame(data)
print(df)
# Group the DataFrame by 'School Code'
grouped = df.groupby('School Code')

# Check the type of the GroupBy object
print(type(grouped))

   Student School Code  Age  height  weight  class
0    Alice        S001   25     165      58      8
1      Bob        S002   24     155      56      9
2  Charlie        S001   22     145      66      8
3    David        S003   23     170      69      9
4      Eve        S002   26     176      65     10
<class 'pandas.core.groupby.generic.DataFrameGroupBy'>